document.addEventListener("DOMContentLoaded", function () {
    const days = [
        {
            title: "วันมาฆบูชา",
            desc: "วันที่พระพุทธเจ้าทรงแสดงโอวาทปาฏิโมกข์",
            img: "https://i.pinimg.com/736x/d2/16/36/d216361bacba7a1d8508ec5b1f270027.jpg",
            details: {
                history: {
                    event: "วันมาฆบูชา เป็นวันสำคัญทางพระพุทธศาสนา ตรงกับ วันขึ้น 15 ค่ำ เดือน 3 (หรือเดือน 4 ในปีอธิกมาส) ซึ่งเป็นวันที่เกิดเหตุการณ์ จาตุรงคสันนิบาต ซึ่งหมายถึง การประชุมพร้อมกันของพระสงฆ์ 1,250 รูปโดยมิได้นัดหมาย",
                    teaching: "เหตุการณ์สำคัญในวันมาฆบูชา\n" + "1. พระสงฆ์จำนวน 1,250 รูปมาประชุมกันโดยมิได้นัดหมาย" + "พระสงฆ์ทั้งหมดเป็น พระอรหันต์ (ผู้บรรลุธรรม)\n" + "พระสงฆ์ทั้งหมดได้รับการอุปสมบทแบบ เอหิภิกขุอุปสัมปทา ซึ่งหมายถึง พระพุทธเจ้าทรงบวชให้โดยตรง\n"
                        + "2. การแสดง โอวาทปาฏิโมกข์ โดยพระพุทธเจ้า\n" + "พระพุทธเจ้าแสดงหลักคำสอนสำคัญ 3 ข้อ ซึ่งเป็น หัวใจของพระพุทธศาสนา\n"
                        + "3.เกิดขึ้นที่วัดเวฬุวนาราม กรุงราชคฤห์ แคว้นมคธ (อินเดียปัจจุบัน)\n" + "เป็นวัดแห่งแรกที่พระพุทธเจ้าทรงโปรดให้สร้างขึ้นในพระพุทธศาสนา"
                },
                significance: "วันมาฆบูชาเป็นวันแห่งการประกาศหลักธรรม และเป็นวันแห่งความสามัคคีของสงฆ์...",
                rituals: [
                    { name: "เวียนเทียน", description: "พุทธศาสนิกชนร่วมกันเวียนเทียนรอบพระอุโบสถ 3 รอบ..." },
                    { name: "ทำบุญตักบาตร", description: "ในช่วงเช้า ชาวพุทธร่วมกันทำบุญตักบาตรเพื่อสะสมบุญ..." },
                    { name: "ฟังพระธรรมเทศนา", description: "วัดต่างๆ จะจัดแสดงพระธรรมเทศนาเพื่อให้เข้าใจคำสอนพระพุทธเจ้า..." },
                    { name: "รักษาศีลและปฏิบัติธรรม", description: "บางคนจะรักษาศีล 5 หรือศีล 8 และปฏิบัติธรรมตลอดวัน..." }
                ],
                references: [
                    { source: `สำนักงานพระพุทธศาสนาแห่งชาติ` },
                    { source: `https://th.wikipedia.org/wiki/วันมาฆบูชา` }
                ]
            }
        },
        {
            title: "วันวิสาขบูชา",
            desc: "เป็นวันที่เกี่ยวข้องกับ 3 เหตุการณ์สำคัญในชีวิตของพระพุทธเจ้า",
            img: "https://i.pinimg.com/736x/a7/f7/4d/a7f74dc13b36808628bf6feecd2798a9.jpg",
            details: {
                history: {
                    event: "วันวิสาขบูชา ตรงกับ วันขึ้น 15 ค่ำ เดือน 6 ของทุกปี ซึ่งเป็นวันที่เกิดเหตุการณ์สำคัญในพุทธศาสนา 3 ประการ ได้แก่",
                    teaching: `1️⃣ การประสูติของพระพุทธเจ้า
                                พระพุทธเจ้าประสูติในฐานะ เจ้าชายสิทธัตถะ ณ ลุมพินีวัน (ปัจจุบันอยู่ในประเทศเนปาล)เมื่อประสูติแล้ว เจ้าชายทรง ก้าวเดินได้ 7 ก้าว และมีดอกบัวรองรับพระบาท พร้อมตรัสว่า
                                "เราเป็นผู้เลิศในโลก เป็นผู้ประเสริฐในโลก"
                                เจ้าชายสิทธัตถะเป็นพระราชโอรสของ พระเจ้าสุทโธทนะ และ พระนางสิริมหามายา แห่งกรุงกบิลพัสดุ์
                               2️⃣ การตรัสรู้ของพระพุทธเจ้า
                                หลังจากออกบวชและบำเพ็ญเพียรเป็นเวลานาน พระพุทธเจ้าตรัสรู้เป็นพระสัมมาสัมพุทธเจ้า ใต้ ต้นศรีมหาโพธิ์ ณ พุทธคยา ประเทศอินเดีย
                                พระองค์ค้นพบ "อริยสัจ 4" (ความจริงอันประเสริฐ 4 ประการ) ได้แก่
                                ทุกข์ (Dukkha) - ความทุกข์ในชีวิต
                                สมุทัย (Samudaya) - เหตุแห่งทุกข์
                                นิโรธ (Nirodha) - การดับทุกข์
                                มรรค (Magga) - หนทางแห่งการดับทุกข์
                                3️⃣ การปรินิพพานของพระพุทธเจ้า
                                พระพุทธเจ้าทรง ดับขันธปรินิพพาน ที่ สาลวโนทยาน เมืองกุสินารา (ประเทศอินเดีย)
                                พระองค์ทรงแสดงปัจฉิมโอวาทก่อนปรินิพพานว่า
                                "สังขารทั้งหลายมีความเสื่อมไปเป็นธรรมดา เธอทั้งหลายจงยังประโยชน์ตนและประโยชน์ผู้อื่นให้ถึงพร้อมด้วยความไม่ประมาทเถิด"
                                พระพุทธเจ้าทรงดับขันธ์ใน อิริยาบถสีหไสยา (นอนตะแคงขวา หันพระพักตร์ไปทางทิศตะวันตก)

                                📌ทั้ง 3 เหตุการณ์นี้เกิดขึ้นตรงกับวันขึ้น 15 ค่ำ เดือน 6 เหมือนกัน จึงถือว่าวันนี้เป็นวันมหามงคล`
                },
                significance: `1. เป็นวันสำคัญที่สุดในพระพุทธศาสนาเป็นวันที่เกิดเหตุการณ์สำคัญ 3 อย่างในวันเดียวกัน ซึ่งไม่มีศาสดาใดในโลกที่มีเหตุการณ์ลักษณะนี้
                                2. เป็นวันที่องค์การสหประชาชาติ (UN) รับรองเป็นวันสำคัญของโลกองค์การสหประชาชาติ (UN) ประกาศให้วันวิสาขบูชาเป็น "วันสำคัญสากลของโลก" (International Day of Vesak) เมื่อปี 2542 (1999)
                                ประเทศต่างๆ ที่นับถือพระพุทธศาสนา เช่น ไทย, ศรีลังกา, อินเดีย, เมียนมา, ลาว, กัมพูชา, เนปาล และเวียดนาม ต่างจัดงานเฉลิมฉลอง
                                3. เป็นวันแห่งการปฏิบัติธรรมของพุทธศาสนิกชนพุทธศาสนิกชนถือว่าเป็นโอกาสสำคัญในการ ทำบุญ, รักษาศีล, เจริญภาวนา และฟังพระธรรมเทศนาวันวิสาขบูชามักมีการ เวียนเทียน รอบพระอุโบสถเพื่อระลึกถึงพระพุทธเจ้า`,
                rituals: [
                    { name: ` 1. การเวียนเทียน 🌕`, description: `พุทธศาสนิกชน เดินเวียนเทียนรอบพระอุโบสถ 3 รอบแต่ละรอบเป็นการระลึกถึง พระพุทธ พระธรรม พระสงฆ์` },
                    { name: `2. การทำบุญตักบาตร 🍚`, description: `ตอนเช้า ผู้คนจะไป ทำบุญตักบาตร และถวายสังฆทาน ที่วัด` },
                    { name: `3. การฟังพระธรรมเทศนา 📖`, description: `พระสงฆ์จะแสดงพระธรรมเทศนาเกี่ยวกับ อริยสัจ 4 และหลักธรรมคำสอนของพระพุทธเจ้า` },
                    { name: ` 4. การปฏิบัติธรรมและรักษาศีล 🧘‍♂️`, description: `พุทธศาสนิกชนจะ รักษาศีล 5 หรือศีล 8 และปฏิบัติธรรมตลอดวัน` },
                    { name: ` 5. การประดับโคมไฟและพระบรมสารีริกธาตุ`, description: `ในบางวัด จะมีการประดับโคมไฟ เพื่อสักการะพระบรมสารีริกธาตุ` },
                ],
                references: [
                    { source: "กองอนุศาสนาจารย์ กองทัพอากาศ" },
                    { source: "สำนักงานพระพุทธศาสนาแห่งชาติ" }
                ]
            }
        },
        {
            title: "วันอาสาฬหบูชา",
            desc: "วันที่ เกิดพระสงฆ์รูปแรกของโลก",
            img: "https://i.pinimg.com/474x/1a/7f/8e/1a7f8e30b3b3f07fe2e2a1c09f480f5f.jpg",
            details: {
                history: {
                    event: `วันอาสาฬหบูชา เป็นวันสำคัญทางพระพุทธศาสนา ตรงกับวันขึ้น 15 ค่ำ เดือน 8 (หรือเดือน 8 หลัง ในปีอธิกมาส) เป็นวันที่พระพุทธเจ้าทรงแสดง "ธัมมจักกัปปวัตตนสูตร" ซึ่งเป็น ปฐมเทศนา (เทศนาครั้งแรก) และถือเป็นวันที่ เกิดพระสงฆ์รูปแรกของโลก`,
                    teaching: `1️⃣ การแสดงปฐมเทศนา "ธัมมจักกัปปวัตตนสูตร"
                                   เหตุการณ์นี้เกิดขึ้น ณ ป่าอิสิปตนมฤคทายวัน เมืองพาราณสี พระพุทธเจ้าทรงแสดง พระธรรมเทศนาครั้งแรก แก่ ปัญจวัคคีย์ทั้ง 5 (กลุ่มนักบวชที่เคยติดตามพระองค์ก่อนออกบวช)
                                    คำสอนหลักใน ธัมมจักกัปปวัตตนสูตร คือ 
                                    อริยสัจ 4
                                    ทุกข์ (Dukkha) → ความทุกข์ในชีวิต
                                    สมุทัย (Samudaya) → เหตุแห่งทุกข์
                                    นิโรธ (Nirodha) → การดับทุกข์
                                    มรรค (Magga) → หนทางดับทุกข์ (มรรคมีองค์ 8)

                                    มรรคมีองค์ 8 (หนทางแห่งการดับทุกข์)
                                    สัมมาทิฏฐิ (ความเห็นชอบ)
                                    สัมมาสังกัปปะ (ความดำริชอบ)
                                    สัมมาวาจา (การพูดชอบ)
                                    สัมมากัมมันตะ (การกระทำชอบ)
                                    สัมมาอาชีวะ (การเลี้ยงชีพชอบ)
                                    สัมมาวายามะ (ความเพียรชอบ)
                                    สัมมาสติ (การมีสติชอบ)
                                    สัมมาสมาธิ (การมีสมาธิชอบ)
                                    💡 หลังจากฟังปฐมเทศนา พระอัญญาโกณฑัญญะ บรรลุธรรมเป็นพระโสดาบัน และเป็นพระภิกษุรูปแรกของโลก

                                2️⃣ การเกิดขึ้นของพระรัตนตรัย
                                    วันอาสาฬหบูชา เป็นวันที่พระพุทธศาสนาครบองค์ประกอบทั้ง 3 ประการ หรือ "พระรัตนตรัย" ได้แก่
                                    พระพุทธ (Buddha) → พระสัมมาสัมพุทธเจ้า
                                    พระธรรม (Dhamma) → คำสอนของพระพุทธเจ้า
                                    พระสงฆ์ (Sangha) → พระอัญญาโกณฑัญญะ ซึ่งเป็น พระสงฆ์องค์แรกของโลก
                                    💡 ดังนั้น วันอาสาฬหบูชาถือเป็นวันแรกของ "พระพุทธศาสนาอย่างแท้จริง"`
                },
                significance: `1. เป็นวันที่พระพุทธเจ้าทรงแสดงธรรมครั้งแรกการแสดง ธัมมจักกัปปวัตตนสูตร เป็นการ ประกาศธรรมครั้งแรกของโลก
                                ทำให้เกิดการเผยแผ่พระพุทธศาสนาเป็นครั้งแรก
                                2. เป็นวันที่เกิดพระสงฆ์องค์แรกพระอัญญาโกณฑัญญะ เป็น พระภิกษุองค์แรกของพระพุทธศาสนา
                                นับเป็นการเริ่มต้นของ พระรัตนตรัย (พุทธ - ธรรม - สงฆ์)
                                3. เป็นวันที่พระพุทธศาสนาเริ่มต้นสมบูรณ์ เพราะมี พระพุทธเจ้า - พระธรรม - พระสงฆ์ ครบองค์ 3
                                🌏 วันอาสาฬหบูชาในระดับโลก
                                    วันอาสาฬหบูชาได้รับการยอมรับว่าเป็น วันสำคัญของพุทธศาสนา ในหลายประเทศ เช่น
                                    ไทย, ศรีลังกา, อินเดีย, พม่า, ลาว, กัมพูชา และเวียดนาม
                                    ในบางประเทศจะมี เทศกาลแสดงธรรม และเวียนเทียนใหญ่`,
                rituals: [
                    { name: `1. การเวียนเทียน 🌕`, description: `พุทธศาสนิกชนเดิน เวียนเทียนรอบพระอุโบสถ 3 รอบระลึกถึง พระพุทธ พระธรรม พระสงฆ์` },
                    { name: ` 2. การทำบุญตักบาตร 🍚`, description: `ตอนเช้า มีการ ทำบุญตักบาตร ฟังเทศน์ และถวายสังฆทาน` },
                    { name: `3. การฟังพระธรรมเทศนา 📖`, description: `ฟังเทศน์เกี่ยวกับ "ธัมมจักกัปปวัตตนสูตร" และ "อริยสัจ 4"` },
                    { name: `4. การรักษาศีลและปฏิบัติธรรม 🧘‍♂️`, description: `พุทธศาสนิกชนจะ รักษาศีล 5 หรือศีล 8 และ เจริญภาวนา` },
                    { name: `5. การบวชเนกขัมมะ`, description: `มีการ บวชเป็นสามเณร หรือบวชชีพราหมณ์ เพื่อปฏิบัติธรรม` }
                ],
                references: [
                    { source: "สำนักงานพระพุทธศาสนาแห่งชาติ" },
                    { source: "https://www.thaipbs.or.th/news/content/329846" }
                ]
            }
        },
        {
            title: "วันอัฏฐมีบูชา",
            desc: `วันที่จัดพิธีถวายพระเพลิง พระบรมศพของพระพุทธเจ้า`,
            img: "https://i.pinimg.com/736x/22/34/4f/22344ffc031941321d93e5f82520a786.jpg",
            details: {
                history: {
                    event: `วันอัฏฐมีบูชา เป็นวันสำคัญทางพระพุทธศาสนา ตรงกับวันแรม 8 ค่ำ เดือน 6 (หรือเดือน 7 ในปีอธิกมาส) ซึ่งเป็นวันที่จัดพิธีถวายพระเพลิง พระบรมศพของพระพุทธเจ้า หลังจากที่พระองค์ เสด็จดับขันธปรินิพพานมาแล้ว 8 วัน`,
                    teaching: `1️⃣ พิธีถวายพระเพลิงพระพุทธเจ้า
                                 เหตุการณ์นี้เกิดขึ้น ณ เมืองกุสินารา แคว้นมัลละ (ประเทศอินเดียปัจจุบัน)
                                    หลังจากพระพุทธเจ้าดับขันธปรินิพพานในวันวิสาขบูชา (วันขึ้น 15 ค่ำ เดือน 6) พระพุทธศาสนิกชนและพระสงฆ์ต่างร่วมกันบำเพ็ญกุศลถวายเป็นเวลา 7 วัน
                                    ในวันที่ แรม 8 ค่ำ เดือน 6 พวกกษัตริย์มัลละแห่งเมืองกุสินารา ได้ประกอบพิธีถวายพระเพลิงพระบรมศพของพระพุทธเจ้า อย่างสมพระเกียรติ
                                    พระบรมศพของพระพุทธเจ้า ถูกถวายพระเพลิงที่ "มกุฏพันธนเจดีย์" และเมื่อเสร็จสิ้นพิธี จึงมีการแบ่งพระบรมสารีริกธาตุออกเป็น 8 ส่วน เพื่อนำไปบรรจุยังสถานที่สำคัญใน 8 แคว้น
                                    💡 เหตุการณ์นี้ถือเป็นการเสร็จสิ้นภารกิจของพระพุทธเจ้าในโลกมนุษย์อย่างสมบูรณ์
                                2️⃣ การแบ่งพระบรมสารีริกธาตุไปยัง 8 แคว้น
                                 หลังจากพิธีถวายพระเพลิงเสร็จสิ้นแล้ว มีการแบ่งพระบรมสารีริกธาตุของพระพุทธเจ้า ออกเป็น 8 ส่วน
                                 8 แคว้นที่ได้รับพระบรมสารีริกธาตุ ได้แก่: กษัตริย์มัลละแห่งกุสินารา กษัตริย์มัลละแห่งปาวา กษัตริย์ลิจฉวีแห่งเวสาลี กษัตริย์ศากยะแห่งกบิลพัสดุ์ กษัตริย์โกฬิยะแห่งรามคาม
                                    พราหมณ์แห่งเวฏฐทีปกะ กษัตริย์โมริยะแห่งปิปผลิวัน พระเจ้าอาชาตศัตรูแห่งแคว้นมคธ                                                                                                                                                                
                                💡 แต่ละแคว้นได้นำพระบรมสารีริกธาตุไปสร้างสถูปเจดีย์บรรจุไว้ เพื่อให้พุทธศาสนิกชนกราบไหว้บูชา`
                },
                significance: `✅ 1. เป็นวันถวายพระเพลิงพระพุทธเจ้า
                                ถือเป็นวันสุดท้ายที่พระพุทธองค์ประทับอยู่ในโลกมนุษย์ก่อนเข้าสู่ นิพพานอย่างสมบูรณ์
                                ✅ 2. เป็นวันแรกที่เกิด "พระบรมสารีริกธาตุ"
                                หลังจากถวายพระเพลิงแล้ว พระบรมสารีริกธาตุของพระพุทธเจ้าได้ถูกแบ่งออกไปยังแคว้นต่างๆ เพื่อเผยแผ่พระพุทธศาสนา
                                ✅ 3. เป็นวันแห่งการรำลึกถึงพระพุทธเจ้า
                                พุทธศาสนิกชนถือว่าวันนี้เป็นวันที่ควรทำบุญ อุทิศส่วนกุศลให้แก่พระพุทธเจ้า
                                🌏 วันอัฏฐมีบูชาในระดับโลก
                                วันอัฏฐมีบูชาได้รับการยอมรับว่าเป็น วันสำคัญของพุทธศาสนา ในหลายประเทศ เช่น
                                ไทย, ศรีลังกา, อินเดีย, พม่า, ลาว, กัมพูชา และเวียดนาม
                                มีการจัดพิธีเวียนเทียนและฟังธรรมในวัดพุทธทั่วโลก`,
                rituals: [
                    { name: `1. การเวียนเทียน 🌕`, description: `พุทธศาสนิกชน เดินเวียนเทียนรอบพระอุโบสถ 3 รอบ ระลึกถึง พระพุทธ พระธรรม พระสงฆ์` },
                    { name: ` 2. การทำบุญตักบาตร 🍚`, description: `ตอนเช้า มีการ ทำบุญตักบาตร ฟังเทศน์ และถวายสังฆทาน` },
                    { name: `3. การฟังพระธรรมเทศนา 📖`, description: `ฟังเทศน์เกี่ยวกับ พุทธประวัติ เรื่องการถวายพระเพลิงพระพุทธเจ้า` },
                    { name: `4. การรักษาศีลและปฏิบัติธรรม 🧘‍♂️`, description: `พุทธศาสนิกชนจะ รักษาศีล 5 หรือศีล 8 และปฏิบัติธรรม` },
                    { name: `5. การจุดโคมไฟบูชา`, description: `บางวัดมีการจุด "ประทีปโคมไฟ" เพื่อเป็นการรำลึกถึงพระพุทธเจ้า` }
                ],
                references: [
                    { source: "สำนักงานพระพุทธศาสนาแห่งชาติ" },
                    { source: "https://www.thairath.co.th/lifestyle/calendar/2789483" }
                ]
            }
        }
    ];
    const container = document.getElementById("days-container");
    let content = '<div class="row g-4">';
    days.forEach((day, index) => {
        content += `
        <div class="col-md-4">
            <div class="card h-100">
                <img src="${day.img}" class="card-img-top" alt="${day.title}" 
                    style="width: 100%; height: 250px; object-fit: cover; object-position: top; border-top-left-radius: 10px; border-top-right-radius: 10px;">
                <div class="card-body d-flex flex-column">
                    <h5 class="card-title">${day.title}</h5>
                    <p class="card-text flex-grow-1">${day.desc}</p>
                    <button class="btn btn-primary mt-auto" onclick="showDetails(${index})">อ่านเพิ่มเติม</button>
                </div>
            </div>
        </div>`;
    });





    content += '</div>';
    container.innerHTML = content;

    window.showDetails = function (index) {
        const day = days[index];

        document.getElementById("title").innerText = day.title;
        document.getElementById("image").src = day.img;
        document.getElementById("desc").innerText = day.desc;
        document.getElementById("history-event").innerText = day.details.history.event;
        document.getElementById("history-teaching").innerText = day.details.history.teaching;
        document.getElementById("significance").innerText = day.details.significance;

        // **แสดงพิธีกรรม**
        const ritualsList = document.getElementById("rituals-list");
        ritualsList.innerHTML = "";
        day.details.rituals.forEach(ritual => {
            const li = document.createElement("li");
            li.innerHTML = `<strong>${ritual.name}:</strong> ${ritual.description}`;
            ritualsList.appendChild(li);
        });

        // **แสดงอ้างอิง**
        const referencesList = document.getElementById("references-list");
        referencesList.innerHTML = "";
        day.details.references.forEach(ref => {
            const li = document.createElement("li");
            li.innerHTML = `<a href="${ref.source}" target="_blank">${ref.source}</a>`;
            referencesList.appendChild(li);
        });

        // แสดง Section รายละเอียด
        document.getElementById("details").style.display = "block";
        document.getElementById("details").scrollIntoView({ behavior: "smooth" });
    };

    window.hideDetails = function () {
        document.getElementById("events").scrollIntoView({ behavior: "smooth" });
    };
    // ฟังก์ชันเลื่อนหน้าเว็บไปยัง ID ที่กำหนดแบบสมูท
    function scrollToSection(sectionId) {
        const section = document.getElementById(sectionId);
        if (section) {
            section.scrollIntoView({ behavior: "smooth" });
        }
    }
});
document.addEventListener("DOMContentLoaded", function () {
    document.querySelector('a[href="#ifrem-youtube"]').addEventListener("click", function (event) {
        event.preventDefault(); // ป้องกันพฤติกรรมเริ่มต้น
        document.querySelector("#ifrem-youtube").scrollIntoView({ behavior: "smooth" });
    });
});

